import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-home',
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.css'],
})
export class HomeComponent implements OnInit {
  public montages = [
    {
      jobtitle: 'تصميم واجهات المستخدم',
      name: 'جولينا محمد العكيلي (4.7⭐️)',
      img: '../../assets/Users/6.png',
      list: [
        'خبرة خمسة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },

    {
      jobtitle: 'موشن جرافيك',
      name: ' عبد الله مصعب حسن (4.7⭐️)',
      img: '../../assets/Users/4.png',
      list: [
        'خبرة ثلاثة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },

    {
      jobtitle: 'تعديل الفيديوهات',
      name: 'محمد أحمد سمير (4.7⭐️)',
      img: '../../assets/Users/2.png',
      list: [
        'خبرة سبعة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },
    {
      jobtitle: 'مصمم جرافيكي',
      name: 'سمية عمران عبد الله (4.7⭐️)',
      img: '../../assets/Users/8.png',
      list: [
        'خبرة خمسة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },
  ];

  public editings = [
    {
      jobtitle: 'صناعة الأفلام',
      name: 'سحر محمد العبيدي (4.7⭐️)',
      img: '../../assets/Users/7.png',
      list: [
        'خبرة خمسة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },

    {
      jobtitle: 'تصحيح الألوان',
      name: 'روبرت كاظم الحيالي (4.7⭐️)',
      img: '../../assets/Users/5.png',
      list: [
        'خبرة ثلاثة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },

    {
      jobtitle: 'التصوير الفوتوغرافي',
      name: ' جوليا سمير غانم (4.7⭐️)',
      img: '../../assets/Users/1.png',
      list: [
        'خبرة سبعة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },
    {
      jobtitle: 'تصوير المنتجات',
      name: '(⭐️4.7) سعدية محسن معيلو',
      img: '../../assets/Users/3.png',
      list: [
        'خبرة خمسة سنوات',
        'خبرة جامعية بنفس التخصص',
        'إمكانية العمل عن بعد',
        'معرض أعمال خاص',
      ],
    },
  ];
  constructor() {}

  ngOnInit(): void {}
}
